{
  "id": 6,
  "title": "MAXIMILIEN_ROBESPIERRE",
  "date": "18/02/2019",
  "status": "Completed",
  "keywords": [
    "goldsmiths",
    "research",
    "api",
    "python",
    "data_sync",
    "data_visualisation"
  ],
  "videoUrl": "/media/MAXIMILIEN_ROBESPIERRE/0.mp4",
  "mediaUrl": [
    "https://mirkoPortfolio.b-cdn.net/2019/MAXIMILIEN_ROBESPIERRE/0.jpg",
    "https://mirkoPortfolio.b-cdn.net/2019/MAXIMILIEN_ROBESPIERRE/0.mp4",
    "https://mirkoPortfolio.b-cdn.net/2019/MAXIMILIEN_ROBESPIERRE/1.jpg",
    "https://mirkoPortfolio.b-cdn.net/2019/MAXIMILIEN_ROBESPIERRE/2.jpg",
    "https://mirkoPortfolio.b-cdn.net/2019/MAXIMILIEN_ROBESPIERRE/3.jpg",
    "https://mirkoPortfolio.b-cdn.net/2019/MAXIMILIEN_ROBESPIERRE/4.jpg",
    "https://mirkoPortfolio.b-cdn.net/2019/MAXIMILIEN_ROBESPIERRE/5.jpg",
    "https://mirkoPortfolio.b-cdn.net/2019/MAXIMILIEN_ROBESPIERRE/6.jpg"
  ],
  "imageDescription": [
    ""
  ],
  "subTitle": [
    "Revolutionary Times and Rising Inequality",
    "Repressive Tolerance",
    "Global Interest in Political Reform",
    "The 'Gilet Jaune' Movement",
    "Returning to the Source of Democracy",
    "Echoing Global Movement"
  ],
  "oneLiner": "In a time of revolutionary unrest and rising inequality, global movements like France's 'Gilet Jaune' reflect a yearning to return to true democracy, echoing the principles of historical figures like Robespierre, and challenging a system that has allowed just 8 men to own half the world's wealth.",
  "description": "",
  "paragraph": [
    "We live in a revolutionary time, where the masses are rising against an aging political regime and rising inequality. The downfall of social benefit coincides with the rising of the elite class, as a direct result of the establishment of global neoliberalism policy. From the Oxfam 2017 report, we see that just 8 men own 50% of the world's wealth, which sounds awfully like a monarchy to me. Except that this time they made an improvement to flee the guillotine. Indeed, the installation of democracy brought a golden chance to bring forth a scapegoat.",
    "« In 1965, the German philosopher Herbert Marcuse coined a term for the contradictory system that forbids citizens from becoming involved in politics but at the same time allows them free rein in cultural activities and in opinion-forming, Marcuse referred to it as “repressive tolerance. » -A Brief History of the Masses",
    "Nowadays, we are starting to see a global interest, from the masses, in politics, to bring forth a reform of our capitalist global system. The interest takes from manifestations against their government, taking place around the world: Hong Kong, Barcelona, Lebanon, Indonesia, Baghdad, Venezuela, Algeria, Sudan, Iran, France, etc. Thus, I want to bring forth the concept of democracy as it was originally envisioned during the III republic in France.",
    "My first motivation was the « Gilet Jaune » movement in France. For me, it is very revealing when a country that is known to have the interest of its people at the forefront of their political ideology would now fight against « Le President des Riches ». There the citizen is fighting against the 111% rise of the energy taxes following the privatization of « Gas de France », which means they now have trouble heating themselves in winter. They also after better working conditions, as most of them are forced to work two to three part-time jobs with all the precarity it brings forth.",
    "For a country that brought us democracy and seeing the state it is in, I think it is important to go back to the source. For this reason, I decided to represent the incorruptible Maximilien Robespierre as he was furiously against the monarchy. More precisely, I interpreted his posture, seeing as he welcomes democracy with all his heart, from master Neo-classic painter Jacques-Louis David, in his piece « The Tennis Court Oath ». I chose this piece since it is a key event in the constitution of democratic and resonates with the ongoing manifestation in France as a highly illegal gathering. Therefore, I transposed Robespierre's position from the painting into an avant-garde style sculpture. To keep the concept actual and in correlation with history, I did not include his head since it’s in a box due to a close guillotine shave. Interestingly enough, the dismemberment coincides with the gradual dismantlement of social security in France.",
    "Echoing the vast global movement, toward popular manifestation against their respective political parties, I made the work in multiple pieces. The different individual pieces slide into one another creating a sturdy entity that elevates the power of the masses into a physical form. Much like Jacques-Louis David's research attempting to represent the power of the masses where he first started by representing the many (« The Tennis Court Oath ») but quickly realized that taking a key figure was the way to go (« The Death of Marat »), I bring back Robespierre, therefore, remembering what democracy originally meant."
  ]
}