{
    "title": "Wild",
    "date": "2024",
    "status": "Completed",
    "type": "freelance",
    "keywords": [
      "Frontend",
      "backend",
      "installation",
      "art",
      "raspberry pi",
      "react",
      "node_server",
      "thermal_printer",
      "data_visualisation"
    ],
    "heroImage": "https://workroom.fastfamiliar.com/content/images/size/w2000/2024/11/Wild-8.jpg",
    "oneLiner": "An interactive quiz and dynamic projection for Manchester Museum’s 'Wild' exhibition, reflecting personal values about nature.",
    "videoUrl": "https://youtu.be/mJiZYTCIMTo",
    "projectUrl": "https://workroom.fastfamiliar.com/interdisciplinary-collaboration/",
    "client": "Manchester Museum",
    "description": "Fast Familiar created a personality-style quiz and generative data projection for the Manchester Museum’s ‘Wild’ exhibition. The interactive aimed to help visitors reflect on their values and their relationship to nature, guided by the Nature Futures Framework. Visitors received printed ‘spider web’ tickets visualising their responses using a thermal receipt printer, powered by a custom backend and frontend system.",
    "mediaGallery": [
 
    ],
    "section": [
      {
        "subtitle": "Interactive Design",
        "text": "We developed a fast, intuitive quiz designed for a 5-minute museum dwell time. Inspired by formats like personality tests, it helped visitors explore how their values align with different ecological worldviews from the Nature Futures Framework.",
        "media": "https://workroom.fastfamiliar.com/content/images/size/w1000/2024/11/Wild-1.jpg",
        "url": ""
      },
      {
        "subtitle": "Data Visualisation and Printing",
        "text": "Quiz answers were turned into a unique ‘spider web’ graphic showing how participants aligned with different nature perspectives. These were projected in real time and printed on eco receipt paper using Raspberry Pi-connected thermal printers.",
        "media": "https://workroom.fastfamiliar.com/content/images/size/w1000/2024/11/Wild-11.jpg",
        "url": ""
      },
      {
        "subtitle": "Accessible and Collaborative Workflow",
        "text": "The project included iterative testing, user feedback via Google Forms, and accessibility considerations like high contrast UI options. Weekly cycles with the museum team allowed smooth, collaborative progress from sketch to launch.",
        "media": "https://workroom.fastfamiliar.com/content/images/size/w1000/2024/11/Wild-2.jpg",
        "url": ""
      }
    ]
  }
  