{
    "title": "ON_RUNNING",
    "date": "01/02/2024",
    "status": "Completed",
    "type": "contract",
    "keywords": [
        "neuroscience",
        "wellbeing",
        "technology",
        "sound",
        "neuroaesthetics",
        "EEG"
    ],
    "heroImage": "https://images.ctfassets.net/hnk2vsx53n6l/yHX8995ix5N4gC6pDf0wb/5a25adece2fa93aba53c3ed8885aa3be/ss24-run_culture-editorial-15-RGB.jpg?w=2880&h=1620&fm=avif&f=face&fit=fill&q=80",
    "oneLiner": "Grammy-nominated DJ, Jayda G, joins neuroscientists at Kinda Studios to explain the magic behind your favorite running tracks.",
    "videoUrl": "https://videos.ctfassets.net/hnk2vsx53n6l/4IFv9nuPZ6QyiWNYyrCZ9B/9edb66d21235afc45a8de98c8cec369e/BB23_Jayda_Controller_OFFMagazine.mp4",
    "description": "",
    "project_url": "https://www.on.com/en-gb/stories/your-running-anthem-explained-by-jayda-g-and-neuroscientists",
    "mediaGallery": [],
    "section": [
        {
            "subtitle": "A DROP OF DOPAMINE",
            "text": "There’s no denying it. The drop counts. The drop’s the part of the track that follows a build-up, break, and then sudden switch in rhythm or bass line – a ‘hands in the air’ moment. “It’s that euphoric feeling of completion and reward,” says Robyn Landau from Kinda Studios. “Our brain is a prediction machine. It’s familiar with the structure and anticipates the drop. When our expectation is correct, we get a huge dopamine [a type of neurotransmitter, associated with feelings of happiness and reward] rush. And it motivates us to seek out more.” Jayda agrees. “It’s about the peaks and the troughs. A journey. That’s how you create it.",
            "media": "",
            "url": ""
        },
        {
            "subtitle": "ADD SOME SIZZLE",
            "text": "Pink noise. It’s a sound frequency you’ll find in windswept trees, babbling brookes and – yes – sizzling bacon. “It’s only found in nature. It stimulates your parasympathetic nervous system, which are neural signatures that help us relax, be more creative, more open. Your focus broadens, helping us find our flow state,” Robyn shares. Jayda seeks out nature too. “It’s a meditative sense of grounding – pulling me out of the hamster loop.” The quickest way to broaden your own horizons is to do the same – the science backs up that moving outside makes us healthier and more creative.",
            "media": "",
            "url": ""
        },
        {
            "subtitle": "RIDE THE GAMMA WAVE",
            "text": "Here’s one for YouTube. Music is a tool for Jayda to boost her focus. “When I’m doing calculus, I can listen to music with words. It’s like two different parts of the brain working.” The science of brainwaves explains why, “Our brainwaves carry frequencies that change our states. Faster brainwaves aid our active thinking brain. Slower waves help us relax and meditate. And we can elicit them with sound.” Gamma is a low-frequency brainwave elicited by binaural beats. “By playing 20 and 60 hertz tones in each ear, our brain computes 40 hertz.” This wavelength promotes calm, alert focus.",
            "media": "",
            "url": ""
        },
        {
            "subtitle": "FIND ENERGY IN THE UNEXPECTED",
            "text": "“Prince’s music gets me feeling so creative,” Jayda shares. “His chord progressions are so interesting.” It makes sense. Unfamiliar or dissonant chord structures stimulate the way we think. Robyn tells us, “they change how we process information. Unfamiliar tonalities widen our field of info processing,” which helps us, “think outside the box and expand our mind.”",
            "media": "https://images.ctfassets.net/hnk2vsx53n6l/2MRKhA24VbkQfXFMDqt22S/017d5d4a2832304ea98504610b963dea/ss24-run_culture-editorial-06-sRGB.jpg?w=2880&h=1620&fm=avif&f=center&fit=fill&q=80",
            "url": ""
        },
        {
            "subtitle": "SYNC YOUR BODY AND MIND",
            "text": "Can our minds and bodies beat as one? “When we listen to the same song,” Robyn tells us, “our hearts and brains sync together towards the same beats per minute (BPM) and frequency.” This physiological and neural phenomenon is called synchrony, and it’s behind our most sacred musical moments – something Jayda knows well. “We came here to feel connected to one another. That’s what feeling truly alive is.”",
            "media": "",
            "url": ""
        },
        {
            "subtitle": "ADD EAR CANDY",
            "text": "“When something new happens,” Robyn tells us, “there’s a twitch of dopamine. It’s this sweet spot of enjoyment, between novelty and familiarity. These constant violations of expectations keep us surprised and delighted.” And it’s not all about adding elements. Trust Jayda. “You can create so much by subtracting,” the DJ shares. Energy, like life, really is about balance.",
            "media": "",
            "url": ""
        }
    ]
}